In [78]:
import pandas as pd
url = 'https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv'
df = pd.read_csv(url)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [79]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [80]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [81]:
data = {
    'Pclass': [1, 2, 3],
    'TicketPrice': [100, 75, 50]  # Hypothetical Prices
}
df_pricing = pd.DataFrame(data)
df_pricing

   Pclass  TicketPrice
0       1          100
1       2           75
2       3           50

In [82]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [83]:
df= df[df['Age'].notnull()].copy()

In [84]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [85]:
#example:finding not null in any column
df['Cabin'].notnull()

0      False
1       True
2      False
3       True
4      False
       ...
885    False
886    False
887     True
889     True
890    False
Name: Cabin, Length: 714, dtype: bool

In [86]:
#example for isnull sum in specific columm
df['Cabin'].isnull().sum

<bound method Series.sum of 0       True
1      False
2       True
3      False
4       True
       ...
885     True
886     True
887    False
889    False
890     True
Name: Cabin, Length: 714, dtype: bool>

In [87]:
#example for isnull
df.isnull().sum

<bound method DataFrame.sum of      PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket  \
0          False     False   False  False  False  False  False  False   False
1          False     False   False  False  False  False  False  False   False
2          False     False   False  False  False  False  False  False   False
3          False     False   False  False  False  False  False  False   False
4          False     False   False  False  False  False  False  False   False
..           ...       ...     ...    ...    ...    ...    ...    ...     ...
885        False     False   False  False  False  False  False  False   False
886        False     False   False  False  False  False  False  False   False
887        False     False   False  False  False  False  False  False   False
889        False     False   False  False  False  False  False  False   False
890        False     False   False  False  False  False  False  False   False

      Fare  Cabin  Embarked
0    False   True     False
1    False  False     False
2    False   True     False
3    False  False     False
4    False   True     False
..     ...    ...       ...
885  False   True     False
886  False   True     False
887  False  False     False
889  False  False     False
890  False   True     False

[714 rows x 12 columns]>

In [88]:
#example for isnull sum 
df.isnull().sum().sum()

np.int64(531)

In [89]:
#example for isnull
df.isnull().any

<bound method DataFrame.any of      PassengerId  Survived  Pclass   Name    Sex    Age  SibSp  Parch  Ticket  \
0          False     False   False  False  False  False  False  False   False
1          False     False   False  False  False  False  False  False   False
2          False     False   False  False  False  False  False  False   False
3          False     False   False  False  False  False  False  False   False
4          False     False   False  False  False  False  False  False   False
..           ...       ...     ...    ...    ...    ...    ...    ...     ...
885        False     False   False  False  False  False  False  False   False
886        False     False   False  False  False  False  False  False   False
887        False     False   False  False  False  False  False  False   False
889        False     False   False  False  False  False  False  False   False
890        False     False   False  False  False  False  False  False   False

      Fare  Cabin  Embarked
0    False   True     False
1    False  False     False
2    False   True     False
3    False  False     False
4    False   True     False
..     ...    ...       ...
885  False   True     False
886  False   True     False
887  False  False     False
889  False  False     False
890  False   True     False

[714 rows x 12 columns]>

In [90]:
#example:for finding rows with any missing data
incomplete_rows = df[df.isnull().any(axis=1)]
print("Incomplete rows:")
print(incomplete_rows)

Incomplete rows:
     PassengerId  Survived  Pclass  \
0              1         0       3
2              3         1       3
4              5         0       3
7              8         0       3
8              9         1       3
..           ...       ...     ...
883          884         0       2
884          885         0       3
885          886         0       3
886          887         0       2
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
4                             Allen, Mr. William Henry    male  35.0      0
7                       Palsson, Master. Gosta Leonard    male   2.0      3
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
..                                                 ...     ...   ...    ...
883                      Banfield, Mr. Frederick James    male  28.0      0
884                             Sutehall, Mr. Henry Jr    male  25.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
886                              Montvila, Rev. Juozas    male  27.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
2        0  STON/O2. 3101282   7.9250   NaN        S
4        0            373450   8.0500   NaN        S
7        1            349909  21.0750   NaN        S
8        2            347742  11.1333   NaN        S
..     ...               ...      ...   ...      ...
883      0  C.A./SOTON 34068  10.5000   NaN        S
884      0   SOTON/OQ 392076   7.0500   NaN        S
885      5            382652  29.1250   NaN        Q
886      0            211536  13.0000   NaN        S
890      0            370376   7.7500   NaN        Q

[531 rows x 12 columns]

In [91]:
df['Embarked'] = df['Embarked'].fillna('S') 
#fillna is for replacing values like null NaN wiith other value

In [92]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [93]:
df.count().sum

<bound method Series.sum of PassengerId    714
Survived       714
Pclass         714
Name           714
Sex            714
Age            714
SibSp          714
Parch          714
Ticket         714
Fare           714
Cabin          185
Embarked       714
dtype: int64>

In [94]:
df_merged = pd.merge(df, df_pricing, on='Pclass', how='left')

In [95]:
df_merged.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,TicketPrice
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,50
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,100
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,50
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,100
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,50

In [96]:
import sys
!{sys.executable} -m pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\saadu\appdata\local\programs\python\python313\lib\site-packages (2.0.42)
Requirement already satisfied: greenlet>=1 in c:\users\saadu\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy) (3.2.3)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\saadu\appdata\local\programs\python\python313\lib\site-packages (from sqlalchemy) (4.12.2)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: C:\Users\saadu\AppData\Local\Programs\Python\Python313\python.exe -m pip install --upgrade pip

In [97]:
from sqlalchemy import create_engine

In [98]:
engine = create_engine('sqlite:///titanic_etl.db', echo=False)
df_merged.to_sql('titanic_data', con=engine, if_exists='replace', index=False)
print("Data loaded into SQLite successfully!")

Data loaded into SQLite successfully!

In [99]:
conn = sqlite3.connect('titanic_etl.db')
cursor = conn.cursor()

query = '''
SELECT Pclass, SUM(Fare) as TotalFareCollected, COUNT(*) as PassengerCount, AVG(TicketPrice) as AvgTicketPrice
FROM titanic_data
GROUP BY Pclass
'''
result = cursor.execute(query).fetchall()

print("Class | TotalFare | PassengerCount | AvgTicketPrice")
for row in result:
    print(row)

conn.close()

Class | TotalFare | PassengerCount | AvgTicketPrice
(1, 16360.8543, 186, 100.0)
(2, 3714.5792, 173, 75.0)
(3, 4696.4495, 355, 50.0)

In [100]:
import sys
!{sys.executable} -m pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\saadu\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\saadu\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)

[notice] A new release of pip is available: 24.3.1 -> 25.2
[notice] To update, run: C:\Users\saadu\AppData\Local\Programs\Python\Python313\python.exe -m pip install --upgrade pip

In [101]:
df_merged['Cabin']=df_merged['Cabin'].fillna('unknown')

In [102]:
df_merged.notnull().count()

PassengerId    714
Survived       714
Pclass         714
Name           714
Sex            714
Age            714
SibSp          714
Parch          714
Ticket         714
Fare           714
Cabin          714
Embarked       714
TicketPrice    714
dtype: int64

In [103]:
df_merged.to_excel('titanic report DE.xlsx',index=False)
print('File Exported')

File Exported